[
    {
        "readonly": false, 
        "type": "str", 
        "name": "sitename", 
        "description_lines": [
            "Name for the GSLB site. Must begin with an ASCII alphanumeric or underscore (_) character, and must contain only ASCII alphanumeric, underscore, hash (#), period (.), space, colon (:), at (@), equals (=), and hyphen (-) characters. Cannot be changed after the virtual server is created.", 
            "CLI Users: If the name includes one or more spaces, enclose the name in double or single quotation marks (for example, \"my gslbsite\" or 'my gslbsite').", 
            "Minimum length = 1"
        ]
    }, 
    {
        "readonly": false, 
        "choices": [
            "REMOTE", 
            "LOCAL"
        ], 
        "type": "str", 
        "name": "sitetype", 
        "description_lines": [
            "Type of site to create. If the type is not specified, the appliance automatically detects and sets the type on the basis of the IP address being assigned to the site. If the specified site IP address is owned by the appliance (for example, a MIP address or SNIP address), the site is a local site. Otherwise, it is a remote site.", 
            "Default value: NONE", 
            "Possible values = REMOTE, LOCAL"
        ]
    }, 
    {
        "readonly": false, 
        "type": "str", 
        "name": "siteipaddress", 
        "description_lines": [
            "IP address for the GSLB site. The GSLB site uses this IP address to communicate with other GSLB sites. For a local site, use any IP address that is owned by the appliance (for example, a SNIP or MIP address, or the IP address of the ADNS service).", 
            "Minimum length = 1"
        ]
    }, 
    {
        "readonly": false, 
        "type": "str", 
        "name": "publicip", 
        "description_lines": [
            "Public IP address for the local site. Required only if the appliance is deployed in a private address space and the site has a public IP address hosted on an external firewall or a NAT device.", 
            "Minimum length = 1"
        ]
    }, 
    {
        "readonly": false, 
        "choices": [
            "ENABLED", 
            "DISABLED"
        ], 
        "type": "str", 
        "name": "metricexchange", 
        "description_lines": [
            "Exchange metrics with other sites. Metrics are exchanged by using Metric Exchange Protocol (MEP). The appliances in the GSLB setup exchange health information once every second.", 
            "If you disable metrics exchange, you can use only static load balancing methods (such as round robin, static proximity, or the hash-based methods), and if you disable metrics exchange when a dynamic load balancing method (such as least connection) is in operation, the appliance falls back to round robin. Also, if you disable metrics exchange, you must use a monitor to determine the state of GSLB services. Otherwise, the service is marked as DOWN.", 
            "Default value: ENABLED", 
            "Possible values = ENABLED, DISABLED"
        ]
    }, 
    {
        "readonly": false, 
        "choices": [
            "ENABLED", 
            "DISABLED"
        ], 
        "type": "str", 
        "name": "nwmetricexchange", 
        "description_lines": [
            "Exchange, with other GSLB sites, network metrics such as round-trip time (RTT), learned from communications with various local DNS (LDNS) servers used by clients. RTT information is used in the dynamic RTT load balancing method, and is exchanged every 5 seconds.", 
            "Default value: ENABLED", 
            "Possible values = ENABLED, DISABLED"
        ]
    }, 
    {
        "readonly": false, 
        "choices": [
            "ENABLED", 
            "DISABLED"
        ], 
        "type": "str", 
        "name": "sessionexchange", 
        "description_lines": [
            "Exchange persistent session entries with other GSLB sites every five seconds.", 
            "Default value: ENABLED", 
            "Possible values = ENABLED, DISABLED"
        ]
    }, 
    {
        "readonly": false, 
        "choices": [
            "ALWAYS", 
            "MEPDOWN", 
            "MEPDOWN_SVCDOWN"
        ], 
        "type": "str", 
        "name": "triggermonitor", 
        "description_lines": [
            "Specify the conditions under which the GSLB service must be monitored by a monitor, if one is bound. Available settings function as follows:", 
            "* ALWAYS - Monitor the GSLB service at all times.", 
            "* MEPDOWN - Monitor the GSLB service only when the exchange of metrics through the Metrics Exchange Protocol (MEP) is disabled.", 
            "MEPDOWN_SVCDOWN - Monitor the service in either of the following situations:", 
            "* The exchange of metrics through MEP is disabled.", 
            "* The exchange of metrics through MEP is enabled but the status of the service, learned through metrics exchange, is DOWN.", 
            "Default value: ALWAYS", 
            "Possible values = ALWAYS, MEPDOWN, MEPDOWN_SVCDOWN"
        ]
    }, 
    {
        "readonly": false, 
        "type": "str", 
        "name": "parentsite", 
        "description_lines": [
            "Parent site of the GSLB site, in a parent-child topology."
        ]
    }, 
    {
        "readonly": false, 
        "type": "str", 
        "name": "clip", 
        "description_lines": [
            "Cluster IP address. Specify this parameter to connect to the remote cluster site for GSLB auto-sync. Note: The cluster IP address is defined when creating the cluster."
        ]
    }, 
    {
        "readonly": false, 
        "type": "str", 
        "name": "publicclip", 
        "description_lines": [
            "IP address to be used to globally access the remote cluster when it is deployed behind a NAT. It can be same as the normal cluster IP address."
        ]
    }, 
    {
        "readonly": false, 
        "type": "str", 
        "name": "naptrreplacementsuffix", 
        "description_lines": [
            "The naptr replacement suffix configured here will be used to construct the naptr replacement field in NAPTR record.", 
            "Minimum length = 1"
        ]
    }, 
    {
        "readonly": true, 
        "choices": [
            "ACTIVE", 
            "INACTIVE", 
            "DOWN"
        ], 
        "type": "str", 
        "name": "status", 
        "description_lines": [
            "Current metric exchange status.", 
            "Possible values = ACTIVE, INACTIVE, DOWN"
        ]
    }, 
    {
        "readonly": true, 
        "choices": [
            "ACTIVE", 
            "INACTIVE", 
            "DOWN"
        ], 
        "type": "str", 
        "name": "persistencemepstatus", 
        "description_lines": [
            "Network metric and persistence exchange MEP connection status.", 
            "Possible values = ACTIVE, INACTIVE, DOWN"
        ]
    }, 
    {
        "readonly": true, 
        "type": "float", 
        "name": "version", 
        "description_lines": [
            "will be true if the remote site's version is ncore compatible with the local site.(>= 9.2)."
        ]
    }, 
    {
        "readonly": true, 
        "type": "float", 
        "name": "__count", 
        "description_lines": [
            "count parameter"
        ]
    }
]