[
    {
        "option_name": "policyname",
        "type": "str",
        "description": [
            "Name of the application firewall policy to bind to the policy label."
        ],
        "is_get_id": false,
        "is_delete_id": false,
        "is_updateable": false
    },
    {
        "option_name": "priority",
        "type": "float",
        "description": [
            "Positive integer specifying the priority of the policy. A lower number specifies a higher priority. Must be unique within a group of policies that are bound to the same bind point or label. Policies are evaluated in the order of their priority numbers."
        ],
        "is_get_id": false,
        "is_delete_id": false,
        "is_updateable": false
    },
    {
        "option_name": "gotopriorityexpression",
        "type": "str",
        "description": [
            "Expression specifying the priority of the next policy which will get evaluated if the current policy rule evaluates to TRUE."
        ],
        "is_get_id": false,
        "is_delete_id": false,
        "is_updateable": false
    },
    {
        "option_name": "invoke",
        "type": "bool",
        "description": [
            "If the current policy evaluates to TRUE, terminate evaluation of policies bound to the current policy label, and then forward the request to the specified virtual server or evaluate the specified policy label."
        ],
        "is_get_id": false,
        "is_delete_id": false,
        "is_updateable": false
    },
    {
        "option_name": "labeltype",
        "type": "str",
        "choices": [
            "reqvserver",
            "policylabel"
        ],
        "description": [
            "Type of policy label to invoke if the current policy evaluates to TRUE and the invoke parameter is set. Available settings function as follows: * reqvserver. Invoke the unnamed policy label associated with the specified request virtual server. * policylabel. Invoke the specified user-defined policy label.",
            "Possible values = reqvserver, policylabel"
        ],
        "is_get_id": false,
        "is_delete_id": false,
        "is_updateable": false
    },
    {
        "option_name": "invoke_labelname",
        "type": "str",
        "description": [
            "Name of the policy label to invoke if the current policy evaluates to TRUE, the invoke parameter is set, and Label Type is set to Policy Label."
        ],
        "is_get_id": false,
        "is_delete_id": false,
        "is_updateable": false
    },
    {
        "option_name": "labelname",
        "type": "str",
        "description": [
            "Name of the application firewall policy label."
        ],
        "is_get_id": true,
        "is_delete_id": false,
        "is_updateable": false
    }
]