[
    {
        "option_name": "name",
        "type": "str",
        "description": [
            "Name for the policy. Must begin with an ASCII alphabetic or underscore (_) character, and must contain only ASCII alphanumeric, underscore, hash (#), period (.), space, colon (:), at (@), equals (=), and hyphen (-) characters.",
            "Minimum length =  1",
            "Maximum length =  31"
        ],
        "is_get_id": true,
        "is_delete_id": true,
        "is_updateable": true
    },
    {
        "option_name": "url",
        "type": "str",
        "description": [
            "URL against which to match incoming client request.",
            "Maximum length =  127"
        ],
        "is_get_id": false,
        "is_delete_id": false,
        "is_updateable": true
    },
    {
        "option_name": "rule",
        "type": "str",
        "description": [
            "Expression against which the traffic is evaluated.",
            "Maximum length of a string literal in the expression is 255 characters. A longer string can be split into smaller strings of up to 255 characters each, and the smaller strings concatenated with the + operator. For example, you can create a 500-character string as follows: '\"<string of 255 characters>\" + \"<string of 245 characters>\"'",
            "The following requirements apply only to the Citrix ADC CLI:",
            "* If the expression includes one or more spaces, enclose the entire expression in double quotation marks.",
            "* If the expression itself includes double quotation marks, escape the quotations by using the  character.",
            "* Alternatively, you can use single quotation marks to enclose the rule, in which case you do not have to escape the double quotation marks.",
            "Maximum length =  1499"
        ],
        "is_get_id": false,
        "is_delete_id": false,
        "is_updateable": true
    },
    {
        "option_name": "delay",
        "type": "float",
        "description": [
            "Delay threshold, in microseconds, for requests that match the policy's URL or rule. If the delay statistics gathered for the matching request exceed the specified delay, SureConnect is triggered for that request.",
            "Minimum value =  1",
            "Maximum value =  599999999"
        ],
        "is_get_id": false,
        "is_delete_id": false,
        "is_updateable": true
    },
    {
        "option_name": "maxconn",
        "type": "float",
        "description": [
            "Maximum number of concurrent connections that can be open for requests that match the policy's URL or rule.",
            "Minimum value =  1",
            "Maximum value =  4294967294"
        ],
        "is_get_id": false,
        "is_delete_id": false,
        "is_updateable": true
    },
    {
        "option_name": "action",
        "type": "str",
        "choices": [
            "ACS",
            "NS",
            "NOACTION"
        ],
        "description": [
            "Action to be taken when the delay or maximum-connections threshold is reached. Available settings function as follows:",
            "ACS - Serve content from an alternative content service.",
            "NS - Serve alternative content from the Citrix ADC.",
            "NO ACTION - Serve no alternative content. However, delay statistics are still collected for the configured URLs, and, if the Maximum Client Connections parameter is set, the number of connections is limited to the value specified by that parameter. (However, alternative content is not served even if the maxConn threshold is met).",
            "Possible values = ACS, NS, NOACTION"
        ],
        "is_get_id": false,
        "is_delete_id": false,
        "is_updateable": true
    },
    {
        "option_name": "altcontentsvcname",
        "type": "str",
        "description": [
            "Name of the alternative content service to be used in the ACS action.",
            "Minimum length =  1",
            "Maximum length =  127"
        ],
        "is_get_id": false,
        "is_delete_id": false,
        "is_updateable": true
    },
    {
        "option_name": "altcontentpath",
        "type": "str",
        "description": [
            "Path to the alternative content service to be used in the ACS action.",
            "Minimum length =  1",
            "Maximum length =  127"
        ],
        "is_get_id": false,
        "is_delete_id": false,
        "is_updateable": true
    }
]