[
    {
        "option_name": "name",
        "type": "str",
        "description": [
            "Name for the SNMPv3 user. Can consist of 1 to 31 characters that include uppercase and lowercase letters, numbers, and the hyphen (-), period (.) pound (#), space ( ), at sign (@), equals (=), colon (:), and underscore (_) characters.",
            "The following requirement applies only to the Citrix ADC CLI:",
            "If the name includes one or more spaces, enclose it in double or single quotation marks (for example, \"my user\" or 'my user').",
            "Minimum length =  1"
        ],
        "is_get_id": true,
        "is_delete_id": true,
        "is_updateable": true
    },
    {
        "option_name": "group",
        "type": "str",
        "description": [
            "Name of the configured SNMPv3 group to which to bind this SNMPv3 user. The access rights (bound SNMPv3 views) and security level set for this group are assigned to this user.",
            "Minimum length =  1"
        ],
        "is_get_id": false,
        "is_delete_id": false,
        "is_updateable": true
    },
    {
        "option_name": "authtype",
        "type": "str",
        "choices": [
            "MD5",
            "SHA"
        ],
        "description": [
            "Authentication algorithm used by the Citrix ADC and the SNMPv3 user for authenticating the communication between them. You must specify the same authentication algorithm when you configure the SNMPv3 user in the SNMP manager.",
            "Possible values = MD5, SHA"
        ],
        "is_get_id": false,
        "is_delete_id": false,
        "is_updateable": true
    },
    {
        "option_name": "authpasswd",
        "type": "str",
        "description": [
            "Plain-text pass phrase to be used by the authentication algorithm specified by the authType (Authentication Type) parameter. Can consist of 1 to 31 characters that include uppercase and lowercase letters, numbers, and the hyphen (-), period (.) pound (#), space ( ), at sign (@), equals (=), colon (:), and underscore (_) characters.",
            "The following requirement applies only to the Citrix ADC CLI:",
            "If the pass phrase includes one or more spaces, enclose it in double or single quotation marks (for example, \"my phrase\" or 'my phrase').",
            "Minimum length =  8"
        ],
        "is_get_id": false,
        "is_delete_id": false,
        "is_updateable": true
    },
    {
        "option_name": "privtype",
        "type": "str",
        "choices": [
            "DES",
            "AES"
        ],
        "description": [
            "Encryption algorithm used by the Citrix ADC and the SNMPv3 user for encrypting the communication between them. You must specify the same encryption algorithm when you configure the SNMPv3 user in the SNMP manager.",
            "Possible values = DES, AES"
        ],
        "is_get_id": false,
        "is_delete_id": false,
        "is_updateable": true
    },
    {
        "option_name": "privpasswd",
        "type": "str",
        "description": [
            "Encryption key to be used by the encryption algorithm specified by the privType (Encryption Type) parameter. Can consist of 1 to 31 characters that include uppercase and lowercase letters, numbers, and the hyphen (-), period (.) pound (#), space ( ), at sign (@), equals (=), colon (:), and underscore (_) characters.",
            "The following requirement applies only to the Citrix ADC CLI:",
            "If the key includes one or more spaces, enclose it in double or single quotation marks (for example, \"my key\" or 'my key').",
            "Minimum length =  8"
        ],
        "is_get_id": false,
        "is_delete_id": false,
        "is_updateable": true
    }
]